Vlans resolved one single problem, switch functionality is to forward traffic to all interfaces when it does not know the mac address destionation on the table. In big infrastructures this can be a pain in the ass, as the performance can be compromised. For that reason, vlans sengment interfaces, so the broadcast traffic is just send it over the vlan ports.


By default, all interfaces are in the default vlan, which is the VLAN1:

![[Pasted image 20241026162345.png]]


[+] Create a Vlan is quite simple:

``` powershell
Switch#config t
Enter configuration commands, one per line. End with CNTL/Z.

Switch(config)#vlan 20
Switch(config-vlan)#name Tier2
```

[+] Vlans are created, now we should add interfaces to it

![[Pasted image 20241026164737.png]]


Interfaces by default are configuired as "dynamic auto"

The `switchport mode dynamic auto` setting on a Cisco switch interface configures the port to negotiate its mode (access or trunk) with the device on the other end of the connection. Here’s how it works:

- **Dynamic Auto** mode means the port will **passively wait** to be asked to become a trunk. If the connected device (on the other side of the link) is set to **dynamic desirable** or **trunk**, this port will dynamically become a trunk.
- If the device on the other end is set to **dynamic auto** or **access**, then this port will stay in **access mode**.

### Dynamic Mode Types

1. **Dynamic Auto**:
    - The port is willing to become a trunk if asked but won’t actively try to negotiate trunking.
2. **Dynamic Desirable**:
    - The port **actively attempts to negotiate** a trunk link with the other end.
    - If connected to a port set to either **dynamic auto** or **trunk**, it will establish a trunk link.

### Example Scenario

If you have two switches:

- **Switch A** interface set to `switchport mode dynamic desirable`
- **Switch B** interface set to `switchport mode dynamic auto`

The link will become a **trunk** because `dynamic desirable` on Switch A will initiate the trunking negotiation, and `dynamic auto` on Switch B will accept it.

### When to Use

- **Dynamic auto** mode is helpful in environments where trunking may or may not be required based on device configurations and allows for more flexibility.
- However, it’s common to explicitly set interfaces to **trunk** or **access** mode for more predictable behavior in production networks, as relying on dynamic modes can sometimes lead to unintended configurations.

```c hl:1,info:"Administrative mode",warn:"dynamic auto"
Switch#sh int f0/10 switch
Name: Fa0/10
Switchport: Enabled
Administrative Mode: dynamic auto
Operational Mode: down
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: native
Negotiation of Trunking: On
Access Mode VLAN: 1 (default)
Trunking Native Mode VLAN: 1 (default)
Voice VLAN: none
Administrative private-vlan host-association: none
Administrative private-vlan mapping: none
Administrative private-vlan trunk native VLAN: none
Administrative private-vlan trunk encapsulation: dot1q
Administrative private-vlan trunk normal VLANs: none
Administrative private-vlan trunk private VLANs: none
Operational private-vlan: none
Trunking VLANs Enabled: All
Pruning VLANs Enabled: 2-1001
Capture Mode Disabled
Capture VLANs Allowed: ALL
Protected: false
Unknown unicast blocked: disabled
Unknown multicast blocked: disabled
Appliance trust: none
```

[+] We need to configure the interfaces as "Access" switchport mode, and then assign them to the proper vlan.
```powershell
Switch#conf t

Enter configuration commands, one per line. End with CNTL/Z.

Switch(config)#int range fa/0-4
Switch(config)#int range f0/1-4
Switch(config-if-range)#sw mode acc
Switch(config-if-range)#exit
Switch(config)#int range f0/1-2
Switch(config-if-range)#sw acc vlan 10
Switch(config-if-range)#exit
Switch(config)#int ran f0/3-4
Switch(config-if-range)#sw acc vlan 20
```

[+] Now there are interafeces assigned to the vlans

![[VMWare/Services DNS-NTP-AD-SMTP-SFTP-CA/Images/Captura de pantalla 2024-10-26 a la(s) 17.00.29.png]]
```powershell hl:"operational mode",warn:"Access Mode VLan:"
Switch#show int f0/1 sw
Name: Fa0/1
Switchport: Enabled
Administrative Mode: static access
Operational Mode: static access
Administrative Trunking Encapsulation: dot1q
Operational Trunking Encapsulation: native
Negotiation of Trunking: Off
Access Mode VLAN: 10 (Tier1)
Trunking Native Mode VLAN: 1 (default)
Voice VLAN: none
Administrative private-vlan host-association: none
Administrative private-vlan mapping: none
Administrative private-vlan trunk native VLAN: none
Administrative private-vlan trunk encapsulation: dot1q
Administrative private-vlan trunk normal VLANs: none
Administrative private-vlan trunk private VLANs: none
Operational private-vlan: none
Trunking VLANs Enabled: All
Pruning VLANs Enabled: 2-1001
Capture Mode Disabled
Capture VLANs Allowed: ALL
Protected: false
Unknown unicast blocked: disabled
Unknown multicast blocked: disabled
Appliance trust: none

```

